results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker02_1threads.3/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     543.32
    fsyncs/s:                     700.09

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.49

General statistics:
    total time:                          10.1218s
    total number of events:              12459

Latency (ms):
         min:                                    0.00
         avg:                                    0.80
         max:                                    9.79
         95th percentile:                        2.86
         sum:                                 9995.51

Threads fairness:
    events (avg/stddev):           12459.0000/0.00
    execution time (avg/stddev):   9.9955/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1210.81
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  18.92
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0009s
    total number of events:              12111

Latency (ms):
         min:                                    0.00
         avg:                                    0.82
         max:                                    9.36
         95th percentile:                        1.27
         sum:                                 9981.81

Threads fairness:
    events (avg/stddev):           12111.0000/0.00
    execution time (avg/stddev):   9.9818/0.00

DONE